{
  "data": [
    {
      "id": "1",
      "manufacturer": "BMW",
      "model": "X5",
      "image": "https://en.wikipedia.org/wiki/File:2019_BMW_X5_M50d_Automatic_3.0.jpg",
      "description": "The BMW X5 is a mid-size luxury crossover SUV produced by BMW. The X5 made its debut in 1999 as the E53 model. It was BMW's first SUV. At launch, it featured all-wheel drive and was available with either a manual or automatic gearbox. The second generation was launched in 2006, and was known internally as the E70. The E70 featured the torque-split capable xDrive all-wheel drive system mated to an automatic gearbox. In 2009, the X5 M performance variant was released as a 2010 model. BMW marketed the X5 officially as a \"Sports Activity Vehicle\" (SAV), rather than an SUV, to indicate its on-road handling capability despite its large dimensions. The X5 signaled a shift away from the utilisation of body-on-frame construction, in favour of more modern monocoque chassis construction. Although the Mercedes-Benz M-Class was introduced more than a year prior to the X5, the X5 was the first to utilise a monocoque chassis. The M-Class used body-on-frame construction until its second generation. The X5 is primarily manufactured in North America, at BMW Group Plant Spartanburg. Assembly operations also took place in Russia by Avtotor until February 2022, along with operations in India, Indonesia, Malaysia, and Thailand. The X5 is also modified for armoured security versions, at the BMW de México Toluca plant. The automaker's SAV series, which was started by the X5, has expanded with derivations of other number-series BMWs. This began in 2003 with the X3, and continued in 2008 with the X6 (which shares its platform with the X5)."
    },
    {
      "id": "2",
      "manufacturer": "Volkswagen",
      "model": "Golf",
      "image": "https://en.wikipedia.org/wiki/File:2020_Volkswagen_Golf_Style_1.5_Front.jpg",
      "description": "The Volkswagen Golf (listenⓘ) is a compact car/small family car (C-segment) produced by the German automotive manufacturer Volkswagen since 1974, marketed worldwide across eight generations, in various body configurations and under various nameplates – including as the Volkswagen Rabbit in the United States and Canada (Mk1 and Mk5), and as the Volkswagen Caribe[1] in Mexico (Mk1). The original Golf Mk1 was a front-engined, front-wheel drive replacement for the air-cooled, rear-engined, rear-wheel drive Volkswagen Beetle. Historically, the Golf is Volkswagen's best-selling model and is among the world's top three best-selling models, with more than 35 million units sold as of 2019. Initially, most Golfs were hatchbacks, with the three-door version being somewhat more popular than the five-door.[5] Other variants include an estate (Variant, from 1993), convertible (Cabriolet or Cabrio, from 1979), and a Golf-based saloon called the Jetta, Vento (from 1992), or Bora (from 1999). The Golf covers economy to high-performance market segments. The Golf has won awards, including the World Car of the Year in 2009, with the Mk6 and in 2013 with the Mk7. Along with the Renault Clio and the Vauxhall Astra, the Golf is one of only three cars to have won European Car of the Year twice, in 1992 and 2013.[6][7] The Golf has made the annual Car and Driver 10Best list multiple times. The Mk7 won the Motor Trend Car of the Year award in 2015, and the Mk1 GTI also won the award in 1985. The Mk4 won for the best-selling car in Europe in 2001."
    },
    {
      "id": "3",
      "manufacturer": "Porsche",
      "model": "911",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Porsche_911_No_1000000%2C_70_Years_Porsche_Sports_Car%2C_Berlin_%281X7A3888%29.jpg/960px-Porsche_911_No_1000000%2C_70_Years_Porsche_Sports_Car%2C_Berlin_%281X7A3888%29.jpg",
      "description": "The Porsche 911 model series (pronounced Nine Eleven or in German: Neunelf) is a family of German two-door, high performance rear-engine sports cars, introduced in September 1964 by Porsche AG of Stuttgart, Germany, and now in its eighth generation. All 911s have a rear-mounted flat-six engine, and usually 2+2 seating, except for special 2-seater variants. Originally, 911s had air-cooled engines, and torsion bar suspension, but the 911 has been continuously enhanced, and evolved across generations. Though the 911 core concept has remained largely unchanged,[1] water-cooled engines were introduced with the 996 series in 1998,[2][3] and front and rear suspension have been replaced by Porsche-specific MacPherson suspension up front, and independent multi-link rear suspension. The 911 has been raced extensively by private and factory teams, in a variety of classes. It is among the most successful competition cars. In the mid-1970s, the naturally aspirated 911 Carrera RSR won world championship races including Targa Florio and the 24 Hours of Daytona. The 911-derived 935 turbo also won the 24 Hours of Le Mans in 1979. Porsche won the World Championship for Makes in 1976, 1977, 1978, and 1979 with 911-derived models. In a 1999 poll to determine the Car of the Century, the 911 ranked fifth[4] — one of two in the top five that had remained continuously in production (the original Beetle remained in production until 2003).[5] The one millionth example was manufactured in May 2017 and is in the company's permanent collection."
    }
  ]
}
